{
  "education": [
    {
      "awards_achievements": [
        "member of professional development club"
      ],
      "degree": "Masters in Electrical and Computer Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2019-2021",
      "school_name": "University of Ottawa"
    },
    {
      "awards_achievements": [
        "placement team coordinator"
      ],
      "degree": "Bachelors of Technology in Computer Science and Engineering",
      "department": "Computer Science",
      "duration": "2014-2018",
      "school_name": "Guru Nanak Dev University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NidhiBhati",
  "highlighted_projects": [
    {
      "description": "Produced similar clusters of Gutenbergs library books using various clustering algorithms, compared performance and accuracy of each cluster sample based on their silhouette and kappa score generated by respective clustering algorithm. Model was built on data of seven different books of different genres, different semantics and at least 200 documents of each book were taken randomly, which includes 150 words of each sample. Clustering was done using K-means, Agglomerative clustering and Gaussian mixture, in which Gaussian mixture stood out in producing right clusters",
      "git_url": "https://github.com/Nidhibhati51/NLP_clustering",
      "name": "Text Clustering Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": " Implemented a monitoring agent that can track the hardware specifications and usage throughout time of host machines and store their data in a database. The monitoring agent is programmed using Bash, and Postgres is used as a database, which would run in a Docker container. Testing was all done on a CentOS 7 virtual machine running on the Google Cloud Platform. Every script was tested manually to ensure that they all adhere to their specifications.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Analyzed a company's transaction data and generated reports about their monthly revenue, and their new and existing users. Created an RFM (Recency, Frequency, Monetary) report about their customer base to determine which customers they should expedite more of their energy towards.All analyses were conducted using a Jupyter notebook, and Python was used along with libraries such as Pandas, Matplotlib, NumPy, and SQLAlchemy. Docker was used to run the Postgres container, which is the company's data warehouse",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Not started",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Not Started",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "Not started",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Nidhi Bhati",
  "others": [
    {
      "bullets": [
        "Video games",
        "Cycling",
        "singing"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Worked as a Data Engineer and developed projects using technologies, such as Python, SQL,  Docker, RDBMS. Collaborated with team members in daily scrum meetings, sprint meetings, and code review sessions with senior developers to get involved in Agile/Scrum practice.",
      "duration": "2022-present",
      "title": "Data Engineer"
    },
    {
      "company": "Multimedia Communications Lab, Uottawa",
      "description": "Built a mobile application in React for the uOttawa sports club, which allowed athletes to track and choose their training programs and for coaches to build customized workout plans and view health statistics. Migrated a manual coach/athlete database system to an online mobile application in iOS Expo Go using MongoDB, which resulted in an over two-fold decrease in accessibility times.",
      "duration": "2020-2021",
      "title": "Research Project Student"
    }
  ],
  "skills": {
    "competent": [
      "java",
      "R",
      "NoSQL",
      "HTML/CSS",
      "NLP"
    ],
    "familiar": [
      "Data visualization",
      "Machine Learning",
      "Javascript",
      "React",
      "Data analysis"
    ],
    "proficient": [
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a new graduate from University of Ottawa, where I earned my Masters in Electrical and Computer Engineering. I studied computer science as my major.During my university years, I had opportunities to work with professional teams as a research student to build a solid programming foundation and explore my interest in data analysis and engineering. Besides, I am also a team player and an  adaptable person, who will mold as the situation demands. I joined the Jarvis Consulting Group a few months after graduating and began training for a Data Engineering position. Right now, I am looking for a position at a company where I can put the skills I have learned to good use, while hopefully also continuing to learn so that I might better myself further."
}
